[Killed] PublicVisibility
Projects/infection/src/Bla.php:7:5
 
 class Bla
 {
-    public function ceva(float $a, float $b, bool $c = false): float
+    protected function ceva(float $a, float $b, bool $c = false) : float
     {
         $factor = ($c) ? 1.1 : 1;
killedBy: bpopescu\infection\tests\BlaTest::testBla with data set #0
statusReason: 1) bpopescu\infection\tests\BlaTest::testBla with data set #0 (1, 2, false, 2)
Error: Call to protected method bpopescu\infection\Bla::ceva() from context 'bpopescu\infection\tests\BlaTest'

/Users/bpopescu/Projects/infection/tests/BlaTest.php:25
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Survived] FalseValue
Projects/infection/src/Bla.php:7:5
 
 class Bla
 {
-    public function ceva(float $a, float $b, bool $c = false): float
+    public function ceva(float $a, float $b, bool $c = true) : float
     {
         $factor = ($c) ? 1.1 : 1;

[Killed] IncrementInteger
Projects/infection/src/Bla.php:9:9
 {
     public function ceva(float $a, float $b, bool $c = false): float
     {
-        $factor = ($c) ? 1.1 : 1;
+        $factor = $c ? 1.1 : 2;
         return $a * $b * $factor;
     }
killedBy: bpopescu\infection\tests\BlaTest::testBla with data set #0
statusReason: 1) bpopescu\infection\tests\BlaTest::testBla with data set #0 (1, 2, false, 2)
Failed asserting that 4.0 matches expected 2.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:25
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] DecrementInteger
Projects/infection/src/Bla.php:9:9
 {
     public function ceva(float $a, float $b, bool $c = false): float
     {
-        $factor = ($c) ? 1.1 : 1;
+        $factor = $c ? 1.1 : 0;
         return $a * $b * $factor;
     }
killedBy: bpopescu\infection\tests\BlaTest::testBla with data set #0
statusReason: 1) bpopescu\infection\tests\BlaTest::testBla with data set #0 (1, 2, false, 2)
Failed asserting that 0.0 matches expected 2.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:25
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Multiplication
Projects/infection/src/Bla.php:10:9
     public function ceva(float $a, float $b, bool $c = false): float
     {
         $factor = ($c) ? 1.1 : 1;
-        return $a * $b * $factor;
+        return $a / $b * $factor;
     }
 
killedBy: bpopescu\infection\tests\BlaTest::testBla with data set #0
statusReason: 1) bpopescu\infection\tests\BlaTest::testBla with data set #0 (1, 2, false, 2)
Failed asserting that 0.5 matches expected 2.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:25
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Multiplication
Projects/infection/src/Bla.php:10:9
     public function ceva(float $a, float $b, bool $c = false): float
     {
         $factor = ($c) ? 1.1 : 1;
-        return $a * $b * $factor;
+        return $a * $b / $factor;
     }
 
killedBy: bpopescu\infection\tests\BlaTest::testBla with data set #1
statusReason: 1) bpopescu\infection\tests\BlaTest::testBla with data set #1 (1, 2, true, 2.2)
Failed asserting that 1.8181818181818181 matches expected 2.2.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:25
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Projects/infection/src/Bla.php:13:5
         return $a * $b * $factor;
     }
 
-    public function altceva(?float $a, bool $c = true, float $f = 1.111): float
+    public function altceva(?float $a, bool $c = false, float $f = 1.111) : float
     {
         $factor = ($c) ? 1.1 : 1;
killedBy: bpopescu\infection\tests\BlaTest::testAltceva
statusReason: 1) bpopescu\infection\tests\BlaTest::testAltceva
Failed asserting that 2.222 matches expected 2.4442.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:39
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Projects/infection/src/Bla.php:13:5
         return $a * $b * $factor;
     }
 
-    public function altceva(?float $a, bool $c = true, float $f = 1.111): float
+    protected function altceva(?float $a, bool $c = true, float $f = 1.111) : float
     {
         $factor = ($c) ? 1.1 : 1;
killedBy: bpopescu\infection\tests\BlaTest::testAltceva
statusReason: 1) bpopescu\infection\tests\BlaTest::testAltceva
Error: Call to protected method bpopescu\infection\Bla::altceva() from context 'bpopescu\infection\tests\BlaTest'

/Users/bpopescu/Projects/infection/tests/BlaTest.php:35
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Ternary
Projects/infection/src/Bla.php:16:9
     public function altceva(?float $a, bool $c = true, float $f = 1.111): float
     {
         $factor = ($c) ? 1.1 : 1;
-        $x = (!empty($a)) ? $a : 2;
+        $x = !empty($a) ? 2 : $a;
         return $x * $factor * $f;
     }
killedBy: bpopescu\infection\tests\BlaTest::testAltceva
statusReason: 1) bpopescu\infection\tests\BlaTest::testAltceva
Failed asserting that 6.6000000000000005 matches expected 3.3.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:35
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Projects/infection/src/Bla.php:16:9
     public function altceva(?float $a, bool $c = true, float $f = 1.111): float
     {
         $factor = ($c) ? 1.1 : 1;
-        $x = (!empty($a)) ? $a : 2;
+        $x = empty($a) ? $a : 2;
         return $x * $factor * $f;
     }
killedBy: bpopescu\infection\tests\BlaTest::testAltceva
statusReason: 1) bpopescu\infection\tests\BlaTest::testAltceva
Failed asserting that 6.6000000000000005 matches expected 3.3.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:35
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Multiplication
Projects/infection/src/Bla.php:17:9
     {
         $factor = ($c) ? 1.1 : 1;
         $x = (!empty($a)) ? $a : 2;
-        return $x * $factor * $f;
+        return $x / $factor * $f;
     }
 }
killedBy: bpopescu\infection\tests\BlaTest::testAltceva
statusReason: 1) bpopescu\infection\tests\BlaTest::testAltceva
Failed asserting that 2.727272727272727 matches expected 3.3.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:35
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Multiplication
Projects/infection/src/Bla.php:17:9
     {
         $factor = ($c) ? 1.1 : 1;
         $x = (!empty($a)) ? $a : 2;
-        return $x * $factor * $f;
+        return $x * $factor / $f;
     }
 }
killedBy: bpopescu\infection\tests\BlaTest::testAltceva
statusReason: 1) bpopescu\infection\tests\BlaTest::testAltceva
Failed asserting that 0.3666666666666667 matches expected 3.3.

/Users/bpopescu/Projects/infection/tests/BlaTest.php:35
phpvfscomposer:///Users/bpopescu/Projects/infection/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
